{
  "platform": "jetbrains",
  "generatedAt": "2025-11-27T00:42:47.925Z",
  "totalPlugins": 5849,
  "top100": [
    {
      "id": "jetbrains-org.jetbrains.kotlin",
      "name": "Kotlin",
      "author": "JetBrains",
      "description": "Provides language support for Kotlin, a modern programming language designed to make developers happier. Getting Started Public Slack Issue tracker",
      "repo": "JetBrains/intellij-community",
      "downloads": 35972198,
      "stars": 19192,
      "lastUpdated": "2025-11-26T22:33:42Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-dart",
      "name": "Dart",
      "author": "JetBrains",
      "description": "Provides Dart support to JetBrains IDEs and Android Studio. Features Smart coding assistance for Dart that includes code completion, formatting, navigation, intentions, refactorings, and more Integration with the Pub package manager and Dart Analysis Server On-the-fly problem detection with suggestions Built-in debugger for debugging Dart command line and web applications Running and debugging Dart tests Option in the Welcome screen to create new Dart projects Getting started For information on getting started, head over to the documentation for your IDE. For IntelliJ IDEA, you can check out this section in the documentation.",
      "repo": "JetBrains/intellij-plugins",
      "downloads": 25036419,
      "stars": 2241,
      "lastUpdated": "2025-11-26T14:05:32Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-lombook plugin",
      "name": "Lombok",
      "author": "JetBrains",
      "description": "IntelliJ Lombok plugin A plugin that adds first-class support for Project Lombok Features @Getter and @Setter @FieldNameConstants @ToString @EqualsAndHashCode @AllArgsConstructor, @RequiredArgsConstructor and @NoArgsConstructor @Log, @Log4j, @Log4j2, @Slf4j, @XSlf4j, @CommonsLog, @JBossLog, @Flogger, @CustomLog @Data @Builder @SuperBuilder @Singular @Jacksonized @Delegate @Value @Accessors @Tolerate @Wither @With @SneakyThrows @StandardException @val @var experimental @var @UtilityClass Lombok config system Code inspections Refactoring actions (lombok and delombok)",
      "repo": "JetBrains/intellij-community",
      "downloads": 24692947,
      "stars": 19192,
      "lastUpdated": "2025-11-26T22:33:42Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-io.flutter",
      "name": "Flutter",
      "author": "Google",
      "description": "Support for developing Flutter applications. Flutter gives developers an easy and productive way to build and deploy cross-platform, high-performance mobile apps for both Android and iOS. Installing this plugin will also install the Dart plugin. For some tools, this plugin uses Chromium through JxBrowser to display content from the web. JxBrowser complies with LGPL and offers an option to replace Chromium with another component. To do this: Find the JxBrowser files stored in the plugins directory, under /flutter-intellij/jxbrowser. The LGPL requirements are at from JxBrowser, here you can also download the build script to relink with modified components.",
      "repo": "flutter/flutter-intellij",
      "downloads": 22672976,
      "stars": 2015,
      "lastUpdated": "2025-11-26T19:34:03Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-org.intellij.scala",
      "name": "Scala",
      "author": "JetBrains",
      "description": "Adds support for the Scala language. The following features are available for free with IntelliJ IDEA Community Edition: Coding assistance (highlighting, completion, formatting, refactorings, etc.) Navigation, search, information about types and implicits Integration with sbt and other build tools Testing frameworks support (ScalaTest, Specs2, uTest) Scala debugger, worksheets and Ammonite scripts Support for Play Framework, Akka and Scala.js is enabled in IntelliJ IDEA Ultimate.",
      "repo": "JetBrains/intellij-scala",
      "downloads": 22510134,
      "stars": 1220,
      "lastUpdated": "2025-11-26T22:37:54Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-izhangzhihao.rainbow.brackets",
      "name": "Rainbow Brackets",
      "author": "izhangzhihao",
      "description": "Rainbow Brackets for IntelliJ based IDEs/Android Studio/HUAWEI DevEco Studio Core Features Rainbowify various types brackets(Round,Squiggly,Square,Angle) Rainbowify variables for more languages &amp; config colors using color generator Rainbowify indent guidelines Scope highlighting Rainbowify tag name for XML/HTML/template files Rainbowify property name for YAML/JSON Customize colors Color generator JSX support Rainbowify Python keywords &amp; indent guidelines Scope highlighting for Python Current Block Highlighting Block list support Kotlin function literal braces and arrow Supported languages: Java, Scala, Clojure, Kotlin, Python, Haskell, Agda, Rust, JavaScript, TypeScript, Erlang, Go, Groovy, Ruby, Swift, Elixir, ObjectiveC, PHP, HTML, XML, SQL, Apex language, C#, F#, Dart, Pug/Jade, Bash, Vue.js, C# Razor Pages, GLSL(the OpenGL Shading Language), Go Template, C++, C, Solidity, Jinja2, Clang, CPP, C, MDX, FreeMarker, GDScript...",
      "repo": "izhangzhihao/intellij-rainbow-brackets",
      "downloads": 21849470,
      "stars": 4620,
      "lastUpdated": "2025-11-04T23:16:42Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-ideavim",
      "name": "IdeaVim",
      "author": "JetBrains",
      "description": "Vim engine for JetBrains IDEs IdeaVim supports many Vim features including normal/insert/visual modes, motion keys, deletion/changing, marks, registers, some Ex commands, Vim regexps, configuration via ~/.ideavimrc, macros, Vim plugins, etc. See also: GitHub repository: documentation and contributing Issue tracker: feature requests and bug reports",
      "repo": "JetBrains/ideavim",
      "downloads": 19396426,
      "stars": 10027,
      "lastUpdated": "2025-11-26T15:19:45Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-mobi.hsz.idea.gitignore",
      "name": ".ignore",
      "author": "JetBrains",
      "description": ".ignore is a plugin for: .bzrignore (Bazaar).chefignore (Chef).cfignore (CloudFoundry).cvsignore (Cvs).boringignore (Darcs).deployignore (DeployHQ).distignore (WP-CLI).dockerignore (Docker).ebignore (ElasticBeanstalk).eleventyignore (Eleventy).eslintignore (ESLint).flooignore (Floobits)ignore-glob (Fossil).gitignore (Git).gcloudignore (GoogleCloud).helmignore (Kubernetes Helm).jpmignore (Jetpack).jshintignore (JSHint).hgignore (Mercurial).mtn-ignore (Monotone).nodemonignore (Nodemon).npmignore (Npm).nuxtignore (NuxtJS).openapi-generator-ignore (OpenAPI Generator).p4ignore (Perforce).prettierignore (Prettier).ignore (Sourcegraph).stylelintignore (StyleLint).stylintignore (Stylint).swagger-codegen-ignore (SwaggerCodegen).terraformignore (Terraform).tfignore (TF).tokeignore (Tokei).upignore (Up).vercelignore (Vercel).yarnignore (Yarn) files in your project. It supports the following IDEs: Android StudioAppCodeCLionGoLandIntelliJ IDEAPhpStormPyCharmRubyMineWebStormDataGrip Features Files syntax highlightTemplates filtering and selecting in rules generator by name and contentUser custom templatesShow ignored files by specified Gitignore file (right-click on .gitignore file)Create a file in the currently selected directoryGenerate Gitignore rules basing on [GitHub's templates collection][github-gitignore]Add a selected file/directory to Gitignore rules from the popup menuSuggesting .gitignore file creation for a new projectEntries inspection (duplicated, covered, unused, incorrect syntax, relative entries) with quick-fix actionsComments and brackets supportNavigation to entries in Project viewRenaming entries from a dot-ignore fileClose opened ignored files actionCustom user templates with import/export features",
      "repo": "JetBrains/idea-gitignore",
      "downloads": 18660735,
      "stars": 1323,
      "lastUpdated": "2025-07-31T19:48:04Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-org.jetbrains.plugins.github",
      "name": "GitHub",
      "author": "JetBrains",
      "description": "Provides integration with GitHub. Specify your GitHub account to access all of your repositories from the IDE. Clone repositories, create and review pull requests, create gists, and much more. To configure, open Settings / Preferences and go to Version Control | GitHub. Requires the Git plugin.",
      "repo": "JetBrains/intellij-community",
      "downloads": 16937988,
      "stars": 19192,
      "lastUpdated": "2025-11-26T22:33:42Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-ru.adelf.idea.dotenv",
      "name": ".env files",
      "author": "JetBrains",
      "description": "Homepage | Github | Issues. Sponsor: The most productive Laravel development environment. Learn more. Features Environment variables completion based on .env, Dockerfile and docker-compose.yml files. Go to declaration(in .env file) and usages(in code), by Ctrl(Cmd)+click or hot key(Ctrl(Cmd)-B, etc.) .env file syntax highlighter",
      "repo": "JetBrains/idea-php-dotenv-plugin",
      "downloads": 14600234,
      "stars": 182,
      "lastUpdated": "2025-11-20T17:30:52Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-bashsupport",
      "name": "BashSupport",
      "author": "74fbdc48-4b37-460f-9522-cbf82b0059b6",
      "description": "Bash language support for 2020.1 and earlier. Note to all users: Prompted by changes in the JetBrains default plugin offerings, a slow transition away from BashSupport has been started in July 2019. Since it cannot build on top of the new JetBrains Shell plugin, it requires too much maintenance effort for what it adds. So after 10 years of development, BashSupport has been retired. Due to this, BashSupport will not be ported to version 2020.2 and later. Existing versions stay available, so you can still use BashSupport with JetBrains IDEs 2020.1. Alternatively, to use equivalent features (and more) with your JetBrains IDE, you can switch to the newly developed BashSupport Pro. BashSupport Pro is attractively priced starting at 2.30 USD per month. To sweeten the transition: There is a 30-day free trial. You get a 25% discount on licences purchased before Oct 1, 2020. Use coupon code BASHSUPPORT_THANKS. You can re-use your run configurations.",
      "repo": "BashSupport/BashSupport",
      "downloads": 14495430,
      "stars": 588,
      "lastUpdated": "2020-11-11T15:18:07Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-org.intellij.plugins.markdown",
      "name": "Markdown",
      "author": "JetBrains",
      "description": "Provides editing assistance for Markdown files within the IDE. Full support for vanilla Markdown syntax: highlighting, completion, navigation, inspection, intentions, and much more. Live HTML preview, customizable with CSS (except Android Studio, see issue and workaround). Assistance for editing tables and lists: automatic alignment and numbering. Drag and drop to insert images. Language injection in code blocks. Pandoc Converter for HTML, Microsoft Word, and PDF formats. Support for PlantUML diagram rendering (you can add support for Mermaid diagrams with a separate plugin).",
      "repo": "JetBrains/intellij-community",
      "downloads": 13268371,
      "stars": 19193,
      "lastUpdated": "2025-11-26T22:33:42Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-org.toml.lang",
      "name": "Toml",
      "author": "JetBrains",
      "description": "Adds support for the TOML configuration file syntax.",
      "repo": "JetBrains/intellij-community",
      "downloads": 12730893,
      "stars": 19192,
      "lastUpdated": "2025-11-26T22:33:42Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-net.seesharpsoft.intellij.plugins.csv",
      "name": "CSV Editor",
      "author": "9fed028c-a280-435f-8eda-f1ac7185e7eb",
      "description": "Plugin for editing CSV files with a rainbow colored table- &amp; text-editor. It provides syntax-validation, highlighting, customization, and plenty more besides. Features: support for CSV/TSV/PSV file extensions customizable table editor customizable text editor customizable column coloring customizable line comment syntax validation syntax highlighting content formatting quick fix inspections intentions (Alt+Enter), e.g. Quote/Unquote (all), Shift Column Left/Right balloon help &amp; spell checker support for ',', ';', '|' or '↹' as value separator support for '\"' or '\\' as escape character support line comments (# by default, customizable) highlight of active column values tab (↹) separator highlighting TSV/PSV file support: TSV/PSV files are recognized as such but treated as a variant of CSV files, the same syntax highlighting and code style settings are applied. For more detailed information please have a look at the README. Thanks to @royqh1979, @egoisticalgoat, @sabi0, @ptahchiev, @ghost, @MarkJeronimus, FineVisuals and others for supporting me and the project! IntelliJ IDEA Ultimate/PhpStorm/DataGrip/etc.: The plugin is fully compatible with the 'Edit as Table...' functionality.",
      "repo": "SeeSharpSoft/intellij-csv-validator",
      "downloads": 12693962,
      "stars": 394,
      "lastUpdated": "2025-09-07T23:56:32Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-org.sonarlint.idea",
      "name": "SonarQube for IDE",
      "author": "SonarSource",
      "description": "SonarQube for IDE (formerly SonarLint) by Sonar is a free, sophisticated static analysis tool that enhances both your code quality and security. Start analyzing your code early—as you write or generate it. Local analysis automatically identifies quality and security issues in real-time, even with AI-generated code. Then, fix any issues found using a QuickFix or the AI CodeFix feature before pushing to your SCM. This assures your code meets your quality standards and is safe for running in production. Want to understand the \"why\" behind an issue? SonarQube for IDE goes beyond simply highlighting problems, providing detailed contextual information to level up your coding experience and acting as your personal coding tutor. When connected to SonarQube Server or SonarQube Cloud (you can create a free SonarQube Cloud account to get started!), it becomes a powerful, unified code quality platform for your entire team throughout your software development lifecycle. This connection enables sharing of consistent language rulesets and project settings, and unlocks analysis of deeply hidden security issues, fostering collaboration and code uniformity. SonarQube for IDE is the only extension you need in your JetBrains IDE for ensuring both code quality and security. It supports a wide range of languages, including C, C++, Java, Go, JavaScript, TypeScript, Python, C#, Kotlin, Ruby, HTML, CSS, PHP, and PL/SQL. Please check out our documentation for the complete list of supported languages, rules and secret detection capabilities. Get started today for free. Check the Requirements and Installation pages— download SonarQube for IDE in the Extension Marketplace and enjoy safe coding!",
      "repo": "SonarSource/sonarlint-intellij",
      "downloads": 11895595,
      "stars": 629,
      "lastUpdated": "2025-11-26T21:01:45Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.intellij.ideolog",
      "name": "Ideolog",
      "author": "JetBrains",
      "description": "Interactive viewer for '.log' files. Features: Code highlighting based of log level: error, warn, info, etc. Intention to highlight columns (time, category, threads, stack frames) in log file editor. Folding of uninteresting events Hyperlinks of stack traces in log Navigation to source code that emit log events (F7). Go to next error action (Shift + F7) Extends selection Intention tp highlight distance between events (marks time as red) Advanced error stripe (heat map) Custom log format more info: https://github.com/JetBrains/ideolog/wiki/Custom-Log-Formats Issue tracker: https://github.com/JetBrains/ideolog/issues",
      "repo": "JetBrains/ideolog",
      "downloads": 11495613,
      "stars": 273,
      "lastUpdated": "2025-11-25T11:02:05Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-org.jetbrains.plugins.vue",
      "name": "Vue.js",
      "author": "JetBrains",
      "description": "Provides Vue.js support to all JetBrains IDEs that support JavaScript. Features Completion of components, directives, props, and methods in templates Navigation from the component, directives, and event handlers to their definition Coding assistance for different languages inside the template, script, and style tags in .vue files Extract component and rename component refactorings Collection of code snippets for Vue.js New Vue project option in the Welcome screen Getting started For information on getting started, head over to the documentation for your IDE. For WebStorm, you can check out this section in the documentation.",
      "repo": "JetBrains/intellij-plugins",
      "downloads": 10268548,
      "stars": 2241,
      "lastUpdated": "2025-11-26T14:05:32Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.markskelton.one-dark-theme",
      "name": "One Dark Theme",
      "author": "1a1c5548-64f1-4e80-89dc-d3227d13fffc",
      "description": "One Dark theme for JetBrains. Do you need help? Please check the docs FAQs to see if we can solve your problem. If that does not fix your problem, please submit an issue. Setup After installing the theme, go to Preferences | Appearance &amp; Behavior | Appearance and select one of the new themes in the theme dropdown. Once you have selected one of the theme options, click the OK button to apply the changes so you can start enjoying One Dark Theme! Further Documentation Check out the docs for manual installation instructions, additional screenshots, and contributing guidelines. Installation Screenshots Contributing",
      "repo": "one-dark/jetbrains-one-dark-theme",
      "downloads": 9711515,
      "stars": 649,
      "lastUpdated": "2025-11-15T00:11:02Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-cn.yiiguxing.plugin.translate",
      "name": "Translation",
      "author": "db774541-6493-458b-aa54-2835e97ce04f",
      "description": "Translation plugin for IntelliJ-based IDEs. Website | GitHub | Get Started | Donate Features Multiple translation engines. Microsoft Translator. Google Translate. DeepL Translator. Youdao Translate. Alibaba Translate. Baidu Translate. OpenAI Translator, compatible with: DeepSeek Doubao Gemini Kimi Ollama Qwen ... Multiple languages inter-translation. Text to speech. Microsoft Edge TTS. Google TTS. OpenAI TTS. Document translation. Automatic word selection. Automatic word division. Word book.",
      "repo": "YiiGuxing/TranslationPlugin",
      "downloads": 9359370,
      "stars": 11709,
      "lastUpdated": "2025-11-25T23:03:15Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-subversion",
      "name": "Subversion",
      "author": "JetBrains",
      "description": "Provides integration with Subversion VCS. Supports Subversion 1.7 and above. Requires command line svn client.",
      "repo": "JetBrains/intellij-community",
      "downloads": 9337577,
      "stars": 19193,
      "lastUpdated": "2025-11-26T22:33:42Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-aws.toolkit",
      "name": "AWS Toolkit",
      "author": "AWS",
      "description": "Amazon Q and CodeWhisperer CodeWhisperer is now part of Amazon Q. Try the Amazon Q extension. Amazon CodeCatalyst Unified software development service to quickly build and deliver applications on AWS. Dev Environments - launch JetBrains IDEs in a cloud development environment, available on-demand in the cloud and automatically created with branch code and consistent project settings, providing faster setup, development, and testing View, modify, and deploy AWS resources Authentication - Connect to AWS using static credentials, credential process, or AWS identity center Resource Explorer - View and manage AWS resources Run/Debug Local Lambda Functions - Locally test and step-through debug functions in a Lambda-like execution environment provided by the AWS SAM CLI. Supports Java, Python, Node.js, and .NET. Deploy SAM-based Applications - Package, deploy track SAM-based applications CloudWatch Logs - View and search CloudWatch log streams S3 Explorer - Manage S3 buckets, and upload to/download from S3 buckets See the user guide for a full list of services and features supported Getting started About The AWS Toolkit for JetBrains makes it easier to write applications built on Amazon Web Services. If you come across bugs with the toolkit or have feature requests, please raise an issue on our GitHub repository. See the user guide for how to get started",
      "repo": "aws/aws-toolkit-jetbrains",
      "downloads": 8851561,
      "stars": 832,
      "lastUpdated": "2025-11-24T20:18:12Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-pythoncore",
      "name": "Python Community Edition",
      "author": "JetBrains",
      "description": "The Python plug-in provides smart editing for Python scripts. The feature set of the plugin corresponds to PyCharm IDE Community Edition. PyCharm blog Discussion forum Issue tracker",
      "repo": "JetBrains/intellij-community",
      "downloads": 8257905,
      "stars": 19192,
      "lastUpdated": "2025-11-26T22:33:42Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-fr.adrienbrault.idea.symfony2plugin",
      "name": "Symfony Plugin",
      "author": "espend_de",
      "description": "Support for Symfony framework / components. Project Page / Documentation | Donate | Buy License Freemium All features which are inside GitHub are free to use, unless there is reason (e.g. Supporting old Symfony Version, ...) Non-free features are flagged with [paid] inside Documentation and inside the CHANGELOG There is ~15min grace period after project open where all features are available A license must be activated via PhpStorm / Intellij: use menu \"Help -&gt; Register\" or use \"Search Everywhere\" by searching for \"Manage License...\" action A license can be bought at JetBrains Marketplace. Free Discount Code generator for open source contributions are planned. Install Activate plugin per project in \"File -&gt; PHP -&gt; Symfony\" or use auto configuration notification (Required) Install PHP Annotations (Optional) Configure a default project connection in \"Remote Hosts Access / Remote Hosts\" to enable support for remote files in plugin settings (Optional) Ignore Symfony \"cache\" directory because of duplicate classes \"Settings -&gt; Project -&gt; Directories\" (Optional) Install PHP Toolbox (Optional) For XLIFF translations key navigation install Localization or add \"*.xlf\" / \"*.xliff\" to XML \"Editor\" -&gt; \"File Types\" Features Dependency Injection Container References for services in ContainerInterface::get() Detect ContainerInterface::get() result type References for services, tags, events, methods, ... inside yaml, xml and php Indexer to provide live editing without a compiled container Tagged class indexer Doctrine ORM QueryBuilder support, including chaining and nested methods References and TypeProvider for doctrine getRepository TypeProvider for EntityRepository::find/findOneBy/findAll/findBy Field and relations resolving and annotation and yaml Templates/Twig Template names in all file references Provide Template implements and extends goto on linemarker Assets file references like javascript, stylesheets and more Support @Template annotations Trans and transchoice support with annotator, quickquick and translation extraction action References for block names (completion back since PhpStorm8) Variable TypeProvider similar to php with several scopes and providers like docblocks, controller, actions, template inclusion, ... Macro implements goto on linemarker Filter, Function, Macro and Extension support Forms References for form types Form field name references on data_class References for form options, extension, ... Routing References for UrlGenerator::generate() related calls Autocomplete route name in twig templates Go to for routing name methods CodeFolding to display real route uri instead of its name Route parameter completion Other Annotator which notice unknown route, template, service, assets, ... Several stub indexer to provide some live generation provider in replacement for compiled container Linemarker and \"Related File\" to provide possible goto targets and controller action Search Everywhere support and custom search for only Symfony related Symbols \"Navigate &gt; Symfony Symbol\" Bridge for PHP Annotations to support annotation related stuff Dotenv and Docker environments variable extraction for DIC parameter Related Plugins PHP Annotations Localization Drupal Symfony Bridge Laravel Plugin Shopware Plugin PHP Toolbox Contributors Daniel Espendiller",
      "repo": "Haehnchen/idea-php-symfony2-plugin",
      "downloads": 7653472,
      "stars": 928,
      "lastUpdated": "2025-07-02T15:23:38Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-key promoter x",
      "name": "Key Promoter X",
      "author": "halirutan",
      "description": "The Key Promoter X helps you to learn essential shortcuts while you are working. When you use the mouse on a button inside the IDE, the Key Promoter X shows you the keyboard shortcut that you should have used instead. This provides an easy way to learn how to replace tedious mouse work with keyboard keys and helps to transition to a faster, mouse free development. The Key Promoter X tool window shows you a hit-list of the mouse actions you use the most and directly provides you with the shortcut you can use instead. For buttons that don't have a shortcut, the Key Promoter X prompts you with the possibility to directly create one. If Key Promoter X helps you save time and money, consider supporting me by becoming a sponsor of my work. Sponsors allow me to dedicate time to the plugin and keep it running on all the JetBrains IDEs you love. Marketplace | Repository | #key-promoter-x on Slack | Twitch",
      "repo": "halirutan/IntelliJ-Key-Promoter-X",
      "downloads": 7355824,
      "stars": 3076,
      "lastUpdated": "2024-11-18T20:23:26Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-aws.toolkit.core",
      "name": "AWS Core",
      "author": "AWS",
      "description": "This plugin is required to use the Amazon Q or AWS Toolkit plugins. It will be automatically installed if you install either plugin.",
      "repo": "aws/aws-toolkit-jetbrains",
      "downloads": 6305953,
      "stars": 832,
      "lastUpdated": "2025-11-24T20:18:12Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-org.editorconfig.editorconfigjetbrains",
      "name": "EditorConfig",
      "author": "JetBrains",
      "description": "Handles properties in .editorconfig files and applies them to all supported languages in all JetBrains IDEs. Features Code assistance for all supported properties, standard and extended Getting started For more information, check the documentation for EditorConfig files and your IDE.",
      "repo": "JetBrains/intellij-community",
      "downloads": 6207107,
      "stars": 19193,
      "lastUpdated": "2025-11-26T22:33:42Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-name.kropp.intellij.makefile",
      "name": "Makefile Language",
      "author": "JetBrains",
      "description": "This plugin provides GNU Make language support: Syntax highlighting. Keyword and target name completion. Quick-doc for ## comments on a target line. Find Usages and Go to Symbol navigation for targets. Prerequisites resolution. Rules, variables, and conditionals folding. Quick-fixes to create new rules from unresolved prerequisites and remove empty rules. In addition, the plugin provides support for running Make targets using: Make tool window Makefile run configurations Gutter icons Context actions Plugin source code was previously located at https://github.com/kropp/intellij-makefile/",
      "repo": "JetBrains/intellij-plugins",
      "downloads": 6099273,
      "stars": 2241,
      "lastUpdated": "2025-11-26T14:05:32Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.intellij.plugins.vscodekeymap",
      "name": "VSCode Keymap",
      "author": "JetBrains",
      "description": "VSCode keymap for all IntelliJ-based IDEs. Use this plugin if VSCode keymap is not pre-installed in your IDE.",
      "repo": "JetBrains/intellij-community",
      "downloads": 5725150,
      "stars": 19193,
      "lastUpdated": "2025-11-26T22:33:42Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-amazon.q",
      "name": "Amazon Q",
      "author": "AWS",
      "description": "The most capable generative AI-powered assistant for building, operating, and transforming software, with advanced capabilities for managing data and AI Agentic coding experience Amazon Q Developer uses information across native and MCP server-based tools to intelligently perform actions beyond code suggestions, such as reading files, generating code diffs, and running commands based on your natural language instruction. Simply type your prompt in your preferred language and Q Developer will provide continuous status updates and iteratively apply changes based on your feedback, helping you accomplish tasks faster. Implement new features Generate new code across your entire project and implement features. Generate documentation Write API, technical design, and onboarding documentation. Automate code reviews Perform code reviews, flagging suspicious code patterns and assessing deployment risk. Generate unit tests Generate unit tests and add them to your project, helping you improve code quality, fast. Transform workloads /transform to upgrade your Java applications in minutes, not weeks. Core features MCP support Add Model Context Protocol (MCP) servers to give Amazon Q Developer access to important context. Inline suggestions Receive real-time code suggestions ranging from snippets to full functions based on your comments and existing code. 15+ languages supported including Python, TypeScript, Rust, Terraform, AWS Cloudformation, and more Inline chat Seamlessly initial chat within the inline coding experience. Select a section of code that you need assistance with and initiate chat within the editor to request actions such as \"Optimize this code\", \"Add comments\", or \"Write tests\". Chat Generate code, explain code, and get answers about software development. Code reference log Attribute code from Amazon Q that is similar to training data. When code suggestions similar to training data are accepted, they will be added to the code reference log. Getting Started Free Tier - create or log in with an AWS Builder ID (a personal profile from AWS). Pro Tier - if your organization is on the Amazon Q Developer Pro tier, log in with single sign-on. Troubleshooting &amp; feedback File a bug or submit a feature request on our Github repository.",
      "repo": "aws/aws-toolkit-jetbrains",
      "downloads": 5712867,
      "stars": 832,
      "lastUpdated": "2025-11-24T20:18:12Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-checkstyle-idea",
      "name": "CheckStyle-IDEA",
      "author": "0571d40b-f326-48e0-bf32-ef0081b28bd1",
      "description": "This plugin provides both real-time and on-demand scanning of Java files with Checkstyle from within IDEA. Please note this is not an official part of Checkstyle - they neither endorse nor bear responsibility for this plugin. Please see the README for full details.",
      "repo": "jshiell/checkstyle-idea",
      "downloads": 5562436,
      "stars": 914,
      "lastUpdated": "2025-10-25T10:15:53Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-idea.plugin.protoeditor",
      "name": "Protocol Buffers",
      "author": "JetBrains",
      "description": "Provides editor support for Protocol Buffers files. Features: Support for proto2 and proto3 syntax levels. Syntax highlighting. Semantic analysis. References and navigation. Quick documentation. Editor enhancements (completion, brace matching, etc.). Navigating between protobuf files and some other languages (Java, Go, Python).",
      "repo": "JetBrains/intellij-plugins",
      "downloads": 5520867,
      "stars": 2241,
      "lastUpdated": "2025-11-26T14:05:32Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-de.espend.idea.php.annotation",
      "name": "PHP Annotations",
      "author": "espend_de",
      "description": "Extends PhpStorm to support annotations in DocBlocks and provide additional Attributes features PHP Annotation Project Page / Documentation | GitHub | Issues | Donate Installation Just install and be happy Optional: Install Symfony Support Optional: Install PHP Toolbox Optional: Configure plugin \"PHP &gt; Annotations / Attributes\" Features Youtube: PhpStorm: PHP Annotations Plugin Attach PhpClass to their DocTag to support \"Code &gt; Optimize Imports\" Auto alias detection on use statement Filter annotation classes on targets like method, class, property, ... Goto for doc tags and property names Detect annotation property values on phpclass property name including types Index classes with @Annotation inside doc block Plugin extension point Doctrine related providers Class import annotator Class constants in DocTags Doctrine ORM intention and quickfixes for: repository and properties Auto alias import for annotation class Related Plugins PHP Toolbox Drupal Symfony Bridge",
      "repo": "Haehnchen/idea-php-annotation-plugin",
      "downloads": 5412607,
      "stars": 258,
      "lastUpdated": "2025-09-13T08:35:09Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.vladsch.idea.multimarkdown",
      "name": "Markdown Navigator Enhanced",
      "author": "vladsch",
      "description": "Document with pleasure! Work with Markdown files like you do with other languages in the IDE, by getting full support for: Paste images into documents for fast screen capture links Drag &amp; Drop files and images for fast link insertion Formatting to cleanup documents with a key stroke Navigation and Find Usages to find references without effort Copy Markdown as JIRA, YouTrack or HTML formatted text Convert HTML to Markdown by pasting it into a Markdown document. Export to HTML or PDF to share with others Refactoring of all referencing elements: files ⟺ links headings ⟺ ref anchors footnotes ⟺ footnote refs references ⟺ ref links/ref images Completions to reduce typing: link address ⇐ files ref anchors ⇐ headings footnote refs ⇐ footnotes ref links/ref images ⇐ references link text ⇐ ref anchor/link address Error and Warning annotations to help catch mistakes early Intention actions for fast results with less effort Wrap on Typing to keep it nicely formatted as you edit GitHub style rendering that you are used to, out of the box GitLab parsing and rendering extensions Math extension using Katex Charts extension using Mermaid Math block and inline rendering by Katex or codecogs.com PlantUML fenced code rendering by PlantUML or gravizo.com Fast typing response for distraction free editing Fully customizable to adjust to your preferences and project needs",
      "repo": "vsch/idea-multimarkdown",
      "downloads": 5386789,
      "stars": 816,
      "lastUpdated": "2023-05-10T21:26:01Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.intellij.lang.jsgraphql",
      "name": "GraphQL",
      "author": "JetBrains",
      "description": "Provides GraphQL language support to all JetBrains IDEs that support JavaScript. Features Schema-aware completion, error highlighting, and documentation Syntax highlighting, code-formatting, folding, commenting, and brace-matching Execution of queries and mutations with variables against configurable endpoints Support for multiple schemas using graphql-config Getting started For information on getting started with this plugin in IntelliJ-based IDEs, see the documentation.",
      "repo": "JetBrains/js-graphql-intellij-plugin",
      "downloads": 5040054,
      "stars": 893,
      "lastUpdated": "2025-11-20T17:29:34Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.jetbrains.edu",
      "name": "JetBrains Academy",
      "author": "JetBrains",
      "description": "Learn and teach programming with the JetBrains Academy plugin — now with AI-powered features to boost your progress. Turn on the free educational features in your IDE to expand your programming skills, build real-world projects, and create interactive courses — all right inside your JetBrains IDE. Interested in learning? Access over 100 project-based courses in Python, Java, Kotlin, and more. Build projects directly inside your IDE and receive intelligent feedback as you code. Enhance your learning with AI assistance: get hints for coding tasks and instantly look up definitions for key concepts. Learn in your preferred language with AI-powered translations: top courses are available in Chinese, Portuguese (Brazil), Spanish, and other languages. Read the Learner Start Guide for more information. Want to share your knowledge? Create your own interactive courses with theory lessons, coding tasks, quizzes, and personalized feedback. Easily test learner progress and provide assistance with hints and explanations. Gain insights from the knowledge-sharing process, which is extremely valuable for learners, educators, and teams building internal training programs. Read the Course Creator Start Guide for more information.",
      "repo": "JetBrains/educational-plugin",
      "downloads": 4983176,
      "stars": 171,
      "lastUpdated": "2025-11-26T12:55:25Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.tabnine.tabnine",
      "name": "Tabnine: AI Chat & Autocomplete for JavaScript, Python & more",
      "author": "Tabnine",
      "description": "&nbsp; &nbsp; &nbsp; Tabnine: The AI code assistant that you control Tabnine is the AI code assistant that you control — helping development teams of every size use AI to accelerate and simplify the software development process without sacrificing privacy, security, or compliance. Tabnine boosts engineering velocity, code quality, and developer happiness by automating the coding workflow through AI tools customized to your team. Tabnine is trusted by more than 1,000,000 developers across thousands of organizations. Learn how to install and activate Tabnine and get started. Boost developer productivity with AI-powered chat and code completions Tabnine offers best-in-class AI code completion and an AI-powered chat that increases productivity and accelerates the entire software development lifecycle. Here’s what you can do with Tabnine: Plan: Ask Tabnine general coding questions or learn how things work in your specific project and get solutions and references relevant to your workspace. Create: Generate new code using natural language. As you continue coding, Tabnine provides inline code completions, offering real-time, context-aware suggestions that seamlessly blend with your coding style. Test: Ask Tabnine to create tests for a specific function or code in your project, and get back the actual test cases, implementation, and assertion. Tabnine can also use existing tests in your project and suggest tests that align with your project’s testing framework. Fix: When tests fail, you can select code with an error and ask Tabnine for recommendations on how to fix it. Document: Generate documentation for specific sections of your code to enhance readability and make it easy for other team members to understand. Explain: Tabnine Chat can provide you with an explanation for a block of existing code, which is especially useful when reading a new codebase or reading legacy code in languages you don’t know as well. Maintain: In addition to writing new code, Tabnine can help you change the existing code by adding functionality, refactoring, or fixing specific code. Tabnine supports most popular languages, frameworks, and IDEs. Supported languages, frameworks, and libraries: JavaScript, TypeScript, Python, Java, C, C++, C#, Go, Php, Ruby, Kotlin, Dart, Rust, React/Vue, HTML 5, CSS, Lua, Perl, YAML, Cuda, SQL, Scala, Shell (bash), Swift, R, Julia, VB, Groovy, Matlab, Terraform, ABAP. Learn more Supported IDEs: VS Code, JetBrains IDEs (IntelliJ, PyCharm, WebStorm, PhpStorm, Android Studio, GoLand, CLion, Rider, DataGrip, RustRover, RubyMine, DataSpell, Aqua, AppCode), Eclipse, Visual Studio 2022. Learn more The AI code assistant that you control Unlike generic code assistants, Tabnine is: Private: You choose where and how to deploy Tabnine, either as a secure SaaS offering or self-hosted on-premises or in a VPC). We never store your data or share it with any third party. Additionally, we don’t use your data to train our models. This ensures complete privacy and maximizes control over your intellectual property. Personalized: Tabnine delivers an optimized experience for each developer and engineering team. You can increase Tabnine’s contextual awareness by making it aware of your environment — from a developer’s local IDE to the entire codebase — and receive highly personalized results for code completions, explanations, and documentation. Tabnine enterprise customers can further enrich the capability and quality of the output by creating a bespoke model that’s trained on their codebase. Protected: Tabnine is built with enterprise-grade security and compliance at its core. It’s trained exclusively on open source code with permissive licenses, ensuring that you’re never exposed to legal liability. Resources: Homepage Documentation Free 90 day trial Pricing Get support Latest updates in Tabnine Tabnine Enterprise plugin for JetBrains Issue tracker Forum page Source code",
      "repo": "codota/tabnine-intellij",
      "downloads": 4882260,
      "stars": 541,
      "lastUpdated": "2024-03-24T07:44:29Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-string manipulation",
      "name": "StringManipulation",
      "author": "a23f723e-b2d6-48dc-b7a7-5f898c9b0eb5",
      "description": "Case switching, sorting, filtering, incrementing, aligning to columns, grepping, escaping, encoding... Features: Case switching: Switch case (camelCase, kebab-lowercase, KEBAB-UPPERCASE, snake_case, SCREAMING_SNAKE_CASE, dot.case, words lowercase, First word capitalized, Words Capitalized, PascalCase) Toggle: SCREAMING_SNAKE_CASE / camelCase Toggle: snake_case / camelCase Toggle: kebab-case / snake_case Toggle: kebab-case / camelCase Toggle: dot.case / camelCase Toggle: PascalCase / camelCase Toggle: lowercase words / camelCase Toggle: First word capitalized / camelCase Toggle: Capitalized Words / camelCase To camelCase To snake_case To kebab-case To PascalCase To SCREAMING_SNAKE_CASE To Capitalized_Snake_Case Capitalize To lower case To UPPER CASE Invert case To Spring Boot System Env Variable -'Switch case' action can be customized, or new ones can be added in settings -when nothing is selected, then either nothing or whole line or a particular element is selected (report an issue if you find something to improve, each file type needs its own implementation to work flawlessly) Un/Escape: Un/Escape selected Java text Un/Escape selected JavaScript text Un/Escape selected C# text (regular, verbatim, interpolated) Un/Escape selected HTML text Un/Escape selected JSON text Un/Escape selected XML text Un/Escape selected SQL text Un/Escape selected PHP text Convert diacritics (accents) to ASCII Convert non-ASCII to escaped Unicode Convert escaped Unicode to String Unicode normalization (NFD, NFC, NFKC, NFKD) Encode/Decode: Encode selected text to MD5 Hex Encode selected text to SHA-1 Hex Encode selected text to SHA-256 Hex Encode selected text to SHA-512 Hex Encode selected text to SHA3-256 Hex Encode selected text to SHA3-512 Hex De/Encode selected text as URL De/Encode selected text to Base64 (+ zip/deflate) De/Encode selected text to Hex ISO Timestamp to Epoch Milliseconds Epoch Milliseconds to ISO Timestamp Increment/Decrement: Increment/decrement all numbers found. Duplicate selection and increment/decrement all numbers found. Create sequence - Keep first number, replace all other by incrementing Increment duplicate numbers Sort with natural order or Collator: Reversing order of lines Shuffle lines Sort case-sensitive A-z Sort case-sensitive z-A Sort case-insensitive A-Z Sort case-insensitive Z-A Sort line length asc., desc. Sort hexadecimally Sort lines by subselection - only one selection/caret per line is handled Sort tokens (delimited text) Shuffle Characters JSON sort Hierarchical sort Align: Align carets/selections into a vertical line by inserting spaces Format selected text to columns/table by a chosen separator/delimiter and sort by columns Align text to left/center/right Filter/Remove/Trim/Minify/Convert...: Grep Inverted Grep Group by Grep - matched lines will be separated from not matched Trim Trim Leading Trim Trailing Replace whitespaces with a single space char Remove all spaces Remove duplicates (supports multicaret subselection) Keep only duplicate lines Group and Count Remove empty lines Remove consecutive empty lines Remove all newlines Convert Between Char and Int Minify JSON Minify JavaScript Convert Between JSON and YAML Other: Reverse Letters Swap Words Swap Characters/Selections/Lines/Tokens Wrap or shift double quotes to single quotes to backticks Swap between double quotes and single quotes Straighten/Educate quotes Switch file path separators: Windows&lt;-&gt;UNIX Select All Occurrences For All Carets Extend Selection in Different \"CamelHumps\" Mode Multi Replace Duplicate and Multi Replace Paste - camelCased Paste - and Keep Selections Create Border Actions are available under Edit menu, or via the shortcut \"alt M\" and \"alt shift M\". You can setup your own shortcuts for better usability. Popup can be customized in File | Settings | Appearance &amp; Behavior | Menus and Toolbars. Donations | GitHub | Issues",
      "repo": "krasa/StringManipulation",
      "downloads": 4856308,
      "stars": 745,
      "lastUpdated": "2025-08-06T14:26:59Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-org.intellij.plugins.hcl",
      "name": "Terraform and HCL",
      "author": "JetBrains",
      "description": "Improved Terraform and OpenTofu support is tailored for developers, SREs, and DevOps teams, supporting infrastructure management with features like syntax highlighting, code completion, and real-time error checking. Streamline your infrastructure as code (IaC) workflow and boost productivity with comprehensive tooling designed to make development and deployment more efficient. Features: Autocompletion, including for third-party providers from the Terraform Registry. HCL, HIL, TFTPL syntax highlighting and validation Integrated documentation, including for third-party providers from the Terraform Registry. Find Usages / Go to definition for resources, providers, variables, and their properties Rename refactoring Introduce Variable refactoring (for string property values) Several inspections Report usage of deprecated properties Unresolved reference checks (in interpolations) Check required/missing properties in resource/provider Predefined Terraform methods autocompletion in interpolations Better properties validation (type checking) Working with dependent modules Type-specific autocompletion in interpolations",
      "repo": "JetBrains/intellij-plugins",
      "downloads": 4615594,
      "stars": 2241,
      "lastUpdated": "2025-11-26T14:05:32Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-org.jetbrains.plugins.yaml",
      "name": "YAML",
      "author": "JetBrains",
      "description": "Provides syntax highlighting and editor features for YAML language.",
      "repo": "JetBrains/intellij-community",
      "downloads": 4600537,
      "stars": 19193,
      "lastUpdated": "2025-11-26T22:33:42Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-gherkin",
      "name": "Gherkin",
      "author": "JetBrains",
      "description": "Adds support for the Gherkin language, which is used by the Cucumber testing tool. Provides coding assistance for step definitions",
      "repo": "JetBrains/intellij-plugins",
      "downloads": 4501219,
      "stars": 2241,
      "lastUpdated": "2025-11-26T14:05:32Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-plantuml integration",
      "name": "plantuml4idea",
      "author": "a23f723e-b2d6-48dc-b7a7-5f898c9b0eb5",
      "description": "PlantUML diagramming tool integration. Now better and faster, with code navigation and highlighting.",
      "repo": "esteinberg/plantuml4idea",
      "downloads": 4468670,
      "stars": 662,
      "lastUpdated": "2025-07-02T14:43:17Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.dmarcotte.handlebars",
      "name": "Handlebars/Mustache",
      "author": "JetBrains",
      "description": "Provides support for the Handlebars and Mustache template languages to all JetBrains IDEs that support JavaScript. Features Customizable highlighting for the template syntax Completion of closing tags, braces, and HTML tags .html files treated as Handlebars or Mustache files Automatic indentation when typing Getting started For information on getting started, head over to the documentation for your IDE. For WebStorm, you can check out this section in the documentation.",
      "repo": "JetBrains/intellij-plugins",
      "downloads": 4453073,
      "stars": 2241,
      "lastUpdated": "2025-11-26T14:05:32Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-r4intellij",
      "name": "R Language",
      "author": "JetBrains",
      "description": "With the plugin for the R language,&nbsp;you can perform various statistical computing and enjoy your favorite features of the integrated development environment: Coding assistance: Error and syntax&nbsp;highlighting. Code completion. Intention actions and quick fixes. Smart editing and auto-saving changes in your R files. Supported formats: R Script R Markdown Previewing data in the graphic and tabular forms: R Graphics viewer Table View R HTML viewer R Markdown preview Running and debugging R scripts with the live variables view. Managing R packages; ability to create your own R packages. Find a bug? Please, file an issue here. For more details, see PyCharm web help. This plugin comes with ABSOLUTELY NO WARRANTY. This is free software, and you are welcome to redistribute it under certain conditions. Please note the plugin distribution contains Rkernel program covered by GPL-3/AGPL-3 licenses. You can find the source code in the following repositories: Rplugin Rkernel-proto Rkernel",
      "repo": "JetBrains/Rplugin",
      "downloads": 4155076,
      "stars": 67,
      "lastUpdated": "2025-11-25T22:58:16Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.intellij.copyright",
      "name": "Copyright",
      "author": "JetBrains",
      "description": "Ensures that files in a project or module have a consistent copyright notice. It does not guarantee copyright compliance nor does it constitute legal advice. Create multiple copyright profiles to use in different scopes Import existing profiles To configure, open the Settings / Preferences dialog and select Editor | Copyright.",
      "repo": "JetBrains/intellij-community",
      "downloads": 4090210,
      "stars": 19193,
      "lastUpdated": "2025-11-26T22:33:42Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.nasller.codeglancepro",
      "name": "CodeGlance Pro",
      "author": "2225bee4-e4b9-4ec4-b776-bd85d3442893",
      "description": "IntelliJ plugin that displays a zoomed out overview or minimap similar to the one found in Sublime into the editor pane. The minimap allows for quick scrolling letting you jump straight to sections of code. Rework on CodeGlance,support more feature Hide original scrollbar. Right click to quick config. Support markup highlights. Support error stripes highlights. Support Vcs line highlights. Support caret line highlights. Support language ColorScheme. Quick view code on Glance. Automatically calculate width in splitter mode. Ctrl-Shift-G to toggle Glance.",
      "repo": "Nasller/CodeGlancePro",
      "downloads": 4059733,
      "stars": 238,
      "lastUpdated": "2025-11-10T10:20:40Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.thoughtworks.gauge",
      "name": "Gauge",
      "author": "JetBrains",
      "description": "Plugin for writing Gauge tests (originally developed by Thoughtworks Inc.). Supports only steps written in Java. Features: Basic language parsing and highlighting Project Creation with Maven and Gradle Auto completion Navigation from step to implementation Quick Fix for unimplemented steps Execution and Debugging of specs Support for Concepts Refactoring support",
      "repo": "JetBrains/intellij-plugins",
      "downloads": 4056890,
      "stars": 2241,
      "lastUpdated": "2025-11-26T14:05:32Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-intellij.prettierjs",
      "name": "Prettier",
      "author": "JetBrains",
      "description": "Provides Prettier support to all JetBrains IDEs that support JavaScript. Features .js, .ts, .jsx, .tsx, .vue, and other file formatting according to Prettier rules an option to run Prettier on save Getting started For information on getting started, head over to the documentation for your IDE. For WebStorm, you can check out this section in the documentation.",
      "repo": "JetBrains/intellij-plugins",
      "downloads": 3722935,
      "stars": 2241,
      "lastUpdated": "2025-11-26T14:05:32Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-training",
      "name": "IDE Features Trainer",
      "author": "JetBrains",
      "description": "Learn basic shortcuts and essential features interactively — right inside the IDE. No need to read long manuals or look for screencasts. Install the plugin, and open with the Help | IDE Features Trainer menu item. Found a bug or have a feature to suggest? Welcome to the tracker: https://youtrack.jetbrains.com/issues/IFT",
      "repo": "JetBrains/intellij-plugins",
      "downloads": 3573542,
      "stars": 2241,
      "lastUpdated": "2025-11-26T14:05:32Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-karma",
      "name": "Karma",
      "author": "JetBrains",
      "description": "Provides Karma support to all JetBrains IDEs that support JavaScript. Features Test coverage with built-in running, debugging, and monitoring Test results in treeview with easy navigation to test sources Test statuses in the editor with options to run or debug Getting started For information on getting started, head over to the documentation for your IDE. For WebStorm, you can check out this section in the documentation.",
      "repo": "JetBrains/intellij-plugins",
      "downloads": 3365517,
      "stars": 2241,
      "lastUpdated": "2025-11-26T14:05:32Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-grepconsole",
      "name": "Grep Console",
      "author": "a23f723e-b2d6-48dc-b7a7-5f898c9b0eb5",
      "description": "Grep, tail, filter, highlight... everything you need for a console (New Logcat and JS/NPM/GoLand/... Terminals are not supported). Also can highlight the editor... Features: Change colors of matching text. Grep output into a new console tab. Change output or execute any action using custom groovy scripts or plugins. Filter out unwanted lines. Workaround for stdout/stderr stream mixing Fold output. Play sounds on matches. Clear Console on matches. Tail files*. Editor actions: Apply highlights in the editor according to the plugin's console settings. (Main menu | Tools) Toggle highlight on all occurrences of the selected text in the editor. (Ctrl+Alt+F3; Editor Popup Menu; Main menu | Tools) *File Tailing: - Run Configuration - Main menu | Tools | Open File in Console - Main Menu | Help | Tail (IntelliJ) Log in Console - Project View | right click context menu | Tail - Drag&amp;Drop \"Tail File\" panel in the main toolbar - Ctrl + Alt + Shift + E - Tail Quick Switch - http and Windows context menu integration - Encoding auto-detection Inspired by Grep Console plugin for Eclipse Used Remote call plugin implementation for http integration. Donations | GitHub | Issues",
      "repo": "krasa/GrepConsole",
      "downloads": 3202560,
      "stars": 473,
      "lastUpdated": "2025-08-14T11:02:09Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-org.asciidoctor.intellij.asciidoc",
      "name": "AsciiDoc",
      "author": "7e0206d0-b87a-4469-ac38-cafd8aa0fca8",
      "description": "Edit AsciiDoc files in the IDE with syntax highlighting, auto-completion and a live preview. AsciiDoc is a text document format, similar to formats like Markdown, for writing notes, documentation, articles, books, ebooks, slideshows, web pages, man pages and blogs. AsciiDoc files can be translated to many formats including HTML, PDF, EPUB, man page. AsciiDoc comes with, in contrast to Markdown, a well-defined syntax for tables, includes and cross-references. Learn how to use this plugin in the official ûdemy course! This plugin includes support for Antora and Spring REST Docs. By using pandoc, it converts AsciiDoc to Microsoft Word (DOCX). Quick start | User Guide | FAQ | Issue tracker To support the authors of Asciidoctor, please consider supporting us via OpenCollective. For better legibility in the preview, this package includes DejaVu fonts (license). It can render Mermaid diagrams (MIT License) and MathML via MathJax (Apache License 2.0). It bundles Graphviz (Common Public License Version 1.0).",
      "repo": "asciidoctor/asciidoctor-intellij-plugin",
      "downloads": 3004272,
      "stars": 387,
      "lastUpdated": "2025-11-26T20:54:50Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-jonathanlermitage-intellij-extra-icons-plugin",
      "name": "Extra Icons",
      "author": "jonathanlermitage",
      "description": "Add icons for files like Travis YML, Appveyor YML, etc",
      "repo": "jonathanlermitage/intellij-extra-icons-plugin",
      "downloads": 3000000,
      "stars": 179,
      "lastUpdated": "2025-11-26T15:51:25Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-ru.meanmail.plugin.requirements",
      "name": "Requirements",
      "author": "meanmail",
      "description": "Ownership of this plugin is currently undergoing a transfer to JetBrains. We regret to inform you that the paid Pro version of this plugin is no longer available for purchase. We apologize for any inconvenience this may cause. Features Highlighting and Syntax check for requirements.txt files in IDE Reference to subrequirements files (Ctrl + click) Opening packages in a browser (Ctrl + click) Reformat file Support renaming Uninstall package Actions PyCharm, and other products if the Python plugin is installed Install All packages Code Inspections PyCharm, and other products if the Python plugin is installed Check if packages are installed Checking package versions Check for duplicate definitions Checking environment markers All IDEs Check if there are files to which there is a link Quick fixes PyCharm, and other products if the Python plugin is installed Install package Remove duplicate Remove unused package Uninstall package More info meanmail.dev GitHub JetBrains Plugins Repository Your ratings and feedback are very important. The feature will appear the faster the more people request it.",
      "repo": "JetBrains/requirements",
      "downloads": 2967188,
      "stars": 75,
      "lastUpdated": "2023-11-29T14:53:43Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.alibaba.p3c.smartfox",
      "name": "Alibaba Java Coding Guidelines",
      "author": "2fbe0286-ab66-4c1a-b8f5-b6b9884a1f45",
      "description": "Alibaba Java Coding Guidelines plugin support.",
      "repo": "alibaba/p3c",
      "downloads": 2929634,
      "stars": 30774,
      "lastUpdated": "2024-08-06T08:22:02Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-cucumber-java",
      "name": "Cucumber for Java",
      "author": "JetBrains",
      "description": "Adds support for Cucumber testing tools with step definitions written in Java. Provides coding assistance for step definitions Adds a dedicated run/debug configuration type",
      "repo": "JetBrains/intellij-plugins",
      "downloads": 2723612,
      "stars": 2241,
      "lastUpdated": "2025-11-26T14:05:32Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.vermouthx.idea",
      "name": "Dracula Theme",
      "author": "1360f81c-0c2f-439f-afe0-fb7c1d041d7a",
      "description": "Dracula Theme for JetBrains Install All instructions can be found at draculatheme.com/jetbrains. Dracula PRO Dracula PRO is a color scheme and UI theme tailored for programming. Made for terminal emulators, code editors, and syntax highlighters. Designed to be aesthetically pleasing while keeping you focused. Get it now Licence MIT Licence Donation If you like this plugin, you can buy me a cup of coffee. Thank you!",
      "repo": "dracula/jetbrains",
      "downloads": 2702532,
      "stars": 795,
      "lastUpdated": "2025-11-25T16:09:00Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.intellij.plugins.eclipsekeymap",
      "name": "Eclipse Keymap",
      "author": "JetBrains",
      "description": "Eclipse keymap for all IntelliJ-based IDEs. Use this plugin if Eclipse keymap is not pre-installed in your IDE.",
      "repo": "JetBrains/intellij-community",
      "downloads": 2447736,
      "stars": 19192,
      "lastUpdated": "2025-11-26T22:33:42Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.github.tuchg.nonasciicodecompletionhelper",
      "name": "ChinesePinyin-CodeCompletionHelper",
      "author": "a2525738-90ed-48a2-82bb-aa85a09b6dbf",
      "description": "Github| Gitee | Issues English The original intention is that for some businesses that are not suitable for expression in English, you can use a straightforward native language instead of pinyin, and then call what is expressed in your native language as you usually write code to solve some naming difficulties 🤔 Let your IDE support Chinese programming, and enjoy the Chinese intelligent coding experience consistent with the English environment Input pinyin completion. Chinese identifier will be shown below. Input zw and prompt 中文 [Zhong Wen].Polyphonic words complete without differenceSupport all identifiers, including variable names, function names, and class names Compatible with all the Intellij Platform product, indiscriminate Chinese programming, Java, Kotlin, JavaScript, C#，Golang, or Haskell all support... 应JBrains要求添加以上《国际化》说明 #5 中文 初衷在于，一些业务上不太适合用英语表达的，可以用上直白的母语而非拼音，然后像平常写代码那样去调用母语所表达的东西，解决部分命名困难症🤔 让你的 IDE 支持中文智能编码，享受和英文环境一致的中文智能编码体验 拼音输入补全，如果上下文存在 中文 标识符, 输入 zw，则会补全提示中文【ZhongWen】多音字无差别补全函数名、变量名、类名等等标识符，只要能用中文标识的通通都支持支持双拼、五笔等各式输入方式 兼容 JB 全家桶，无差别中文编码，无论是 Java、Python、JavaScript、Kotlin、Golang、C#、C++ 亦或者 Haskell 等等通通都支持 推荐使用中文命名标识符的场景： 因传统文化背景的相关产品标识命名而耽误进度现有项目充斥大量缩写歧义拼音全中文母语开发团队英语素质参差不齐 提示：当提示 no ascii 时，可按提示电灯泡关闭该提示 如果对您有所帮助，别忘了给本项目 Github 主页一颗 Star😁，你的支持是项目前进的动力 💡 Intellij Platform 2022.1官方支持拼音首字母补全，本插件在此基础已可触发 go、c、kotlin等语言的正常补全，为获得更好体验，推荐原本效果不佳的用户更新至该版本",
      "repo": "tuchg/ChinesePinyin-CodeCompletionHelper",
      "downloads": 2413907,
      "stars": 1793,
      "lastUpdated": "2024-03-02T05:03:53Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.jetbrains.gerrypurpletheme",
      "name": "Gerry Themes",
      "author": "gerry",
      "description": "Gerry Themes is a refined collection including 20 themes, designed for a comfortable development experience. Basic features in Gerry Themes &amp; Gerry Themes Pro: Better syntax highlight Unified and clean themes style Button component outline Lightweight and low impact on IDE performance Compatible with both Classic UI and New UI Islands theme variations Pro features in Gerry Themes Pro: All themes in Gerry Themes Extra Pro themes with more filters and contrast color scheme styles Dark themes [Gerry prefix]: Gerry Violet Gerry Oceanic Gerry Storm Gerry Darcula Gerry Dark Light themes [Gerry⟡ prefix]: Gerry⟡ Light Gerry⟡ Violet Low contrast themes [Gerry− prefix]: Low contrast themes(formerly “Gerry Themes for Colorblind”) have been added as a free feature to both Gerry Themes and Gerry Themes Pro. These themes enhance the visual experience by reducing the intensity of green and red, with effects that may vary individually. Gerry− Darcula Gerry− Dark Gerry− Light Legacy themes [Legacy prefix]: Legacy themes are variations designed for users who prefer project browser and editor panel to have different background color. [Legacy] Gerry Dark [Legacy] Gerry Darcula [Legacy] Gerry Violet [Legacy] Gerry Oceanic [Legacy] Gerry Storm [Legacy] Gerry⟡ Light [Legacy] Gerry⟡ Violet Islands themes [Islands prefix]: Islands themes are variations of Islands theme, compatible with IDE 2025.2.3+ and New UI. [Islands] Gerry Darcula [Islands] Gerry Dark [Islands] Gerry⟡ Light Inspiration: This plugin is based on the template from Dark Purple. This plugin is inspired by Atom One Dark and Material Theme UI Lite for JetBrains. Plugin page: Please refer to the plugin page for introduction and documentation.",
      "repo": "gerry-themes/gerry-themes",
      "downloads": 2412987,
      "stars": 34,
      "lastUpdated": "2025-10-20T09:47:34Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.tylerthrailkill.intellij.solarized",
      "name": "Solarized Theme",
      "author": "0c4d0961-c3ab-4647-8ec7-0600d518dd9e",
      "description": "Adds Solarized Dark and Light themes https://ethanschoonover.com/solarized/",
      "repo": "snowe2010/solarized-jetbrains",
      "downloads": 2390731,
      "stars": 50,
      "lastUpdated": "2025-01-29T18:00:09Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.intellij.plugins.visualstudiokeymap",
      "name": "Visual Studio Keymap",
      "author": "JetBrains",
      "description": "Visual Studio keymap for all IntelliJ-based IDEs. Use this plugin if Visual Studio keymap is not pre-installed in your IDE.",
      "repo": "JetBrains/intellij-community",
      "downloads": 2368822,
      "stars": 19193,
      "lastUpdated": "2025-11-26T22:33:42Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-angularjs",
      "name": "Angular",
      "author": "JetBrains",
      "description": "Provides support for Angular to all JetBrains IDEs that support JavaScript. Features Code completion for Angular APIs in TypeScript files Code completion for components, built-in and custom directives, and methods in templates Navigation from the component, custom directives, and event handlers to their definition Collection of code snippets for Angular Option in the Welcome screen to create new Angular projects Generation of new app elements using Angular CLI Getting started For information on getting started, head over to the documentation for your IDE. For WebStorm, you can check out these sections: Angular. Notes This plugin is bundled in WebStorm and some other IntelliJ-based IDEs.",
      "repo": "JetBrains/intellij-plugins",
      "downloads": 2327433,
      "stars": 2241,
      "lastUpdated": "2025-11-26T14:05:32Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-org.jetbrains.idea.maven",
      "name": "Maven",
      "author": "JetBrains",
      "description": "Provides Maven support. The following features are available: Maven Projects tool window. Dedicated module type. Maven repositories support. Full editing support for the pom.xml file. Possibility to import Maven projects. Running and debugging Maven goals. Compiling.",
      "repo": "JetBrains/intellij-community",
      "downloads": 2120272,
      "stars": 19193,
      "lastUpdated": "2025-11-26T22:33:42Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-org.intellij.plugins.postcss",
      "name": "PostCSS",
      "author": "JetBrains",
      "description": "Provides PostCSS support to all JetBrains IDEs that support JavaScript. Features Option to enable PostCSS support for .css files Syntax highlighting, code completion, and other code insight features for the following PostCSS plugins: postcss-custom-properties&lt; postcss-apply postcss-custom-media postcss-media-minmax postcss-custom-selectors postcss-nesting postcss-nested Getting started For information on getting started, head over to the documentation for your IDE. For WebStorm, you can check out this section in the documentation.",
      "repo": "JetBrains/intellij-plugins",
      "downloads": 2104297,
      "stars": 2241,
      "lastUpdated": "2025-11-26T14:05:32Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-cmd support",
      "name": "CMD Support",
      "author": "b5bf1e72-f54f-4967-ade2-26a04d98a9e5",
      "description": "CMD support plugin for Intellij Idea Sources | Issues Features Enables highlighting Adds new actions Compiled with Java 1.6",
      "repo": "t3hnar/CmdSupport",
      "downloads": 2023893,
      "stars": 51,
      "lastUpdated": "2015-05-12T12:37:10Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.intellij.plugins.netbeanskeymap",
      "name": "NetBeans Keymap",
      "author": "JetBrains",
      "description": "NetBeans keymap for all IntelliJ-based IDEs. Use this plugin if NetBeans keymap is not pre-installed in your IDE.",
      "repo": "JetBrains/intellij-community",
      "downloads": 2001504,
      "stars": 19192,
      "lastUpdated": "2025-11-26T22:33:42Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-mechatroner-rainbow-csv",
      "name": "Rainbow CSV",
      "author": "mechatroner",
      "description": "Highlight CSV and TSV files in different colors",
      "repo": "mechatroner/rainbow_csv",
      "downloads": 2000000,
      "stars": 691,
      "lastUpdated": "2025-10-04T04:18:35Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-net.ashald.envfile",
      "name": "EnvFile",
      "author": "0e8d27ec-ffec-47a6-92b3-21f4f7d47d02",
      "description": "EnvFile Compiled with Java 1.8 GitHub | Issues Env File is a plugin for JetBrains IDEs that allows you to set environment variables for your run configurations from one or multiple files. Supported formats: .env YAML dictionary JSON dictionary All formats assume that both keys and values are strings. Supported Platforms: PyCharm IDEA RubyMine GoLand Cursive",
      "repo": "Ashald/EnvFile",
      "downloads": 1963489,
      "stars": 572,
      "lastUpdated": "2024-06-01T18:57:15Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.wakatime.intellij.plugin",
      "name": "WakaTime",
      "author": "1268b6d9-e228-4ea4-bfce-780350a39078",
      "description": "Metrics, insights, and time tracking automatically generated from your programming activity. Installation 1. Inside your IDE, select Preferences -&gt; Plugins -&gt; Browse Repositories.... 2. Search for wakatime. 3. Click the green Install Plugin button and confirm the installation. 4. Re-launch your IDE. 5. Enter your api key, then click Save. 6. Use your IDE like you normally do and your time will be tracked for you automatically. 7. Visit https://wakatime.com to see your logged time. Source Code: https://github.com/wakatime/jetbrains-wakatime",
      "repo": "wakatime/jetbrains-wakatime",
      "downloads": 1943487,
      "stars": 1209,
      "lastUpdated": "2025-05-30T06:56:40Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-dev.meanmail.plugin.nginx-intellij-plugin",
      "name": "Nginx Configuration",
      "author": "meanmail",
      "description": "IDE Plugin for Nginx Configuration Files Designed for working with Nginx configuration files, our plugin offers a comprehensive set of features to enhance your workflow. Free vs Pro Comparison Feature Free Version Pro version Syntax highlighting ✅ ✅ Directive auto-completion ✅ ✅ File navigation ✅ ✅ File structure display ✅ ✅ Comment / Uncomment actions ✅ ✅ Support for custom directives (external modules) ❌ ✅ Advanced inspections ❌ ✅ Lua block syntax highlighting ❌ ✅ Brotli directives ❌ ✅ Auto-formatting ❌ ✅ Quick documentation ❌ ✅ Priority updates and new features ❌ ✅ Priority support ❌ ✅ Key Features: Syntax highlighting: Clear and convenient work with Nginx configurations. Directive auto-completion: Speeds up the editing process. File navigation: Simplifies transitions between related files. Lua block syntax highlighting: Requires an installed Lua syntax support plugin. File structure display: Intuitive tool window for structure overview. Comment and uncomment actions: Convenient commands for code management. More info meanmail.dev Your ratings and feedback are very important. The feature will appear the faster the more people request it.",
      "repo": "meanmail-dev/nginx-intellij-plugin",
      "downloads": 1924665,
      "stars": 66,
      "lastUpdated": "2025-11-21T00:20:35Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-tanvd.grazi",
      "name": "Grazie Lite",
      "author": "JetBrains",
      "description": "Intelligent spelling and grammar checks for any text you write in the IDE. Supports over 20 languages, including English, German, Russian, and Chinese. English is enabled by default. To add other languages, open Settings/Preferences | Editor | Natural Languages. Works with natural languages in programming language constructs (Python, Java, and others), markup languages (Markdown, HTML, XML, and others), comments, and commit messages. Uses LanguageTool as its proofreading engine. Data privacy: all verification is performed locally, inside your IDE.",
      "repo": "JetBrains/intellij-community",
      "downloads": 1911043,
      "stars": 19192,
      "lastUpdated": "2025-11-26T22:33:42Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.developerphil.adbidea",
      "name": "adb_idea",
      "author": "54a32c6b-9732-4f5e-b95a-687a8795dcf8",
      "description": "Adds the following ADB commands to Android Studio and Intellij: ADB Uninstall App ADB Kill App ADB Start App ADB Restart App ADB Clear App Data ADB Clear App Data and Restart ADB Start App With Debugger ADB Restart App With Debugger ADB Grant/Revoke Permissions ADB Enable/Disable Wi-Fi ADB Enable/Disable Mobile Data There are two basic ways to invoke a command: Through the Tools-&gt;Android-&gt;ADB Idea menu By searching for \"ADB\" in \"Find Actions\" (osx: cmd+shift+a, windows/linux: ctrl+shift+a)",
      "repo": "pbreault/adb-idea",
      "downloads": 1874246,
      "stars": 2149,
      "lastUpdated": "2025-03-23T17:30:37Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.thvardhan.gradianto",
      "name": "Gradianto",
      "author": "7dc0e944-465d-47a0-ba21-58c59cc0f08b",
      "description": "About Gradianto aims to be easy on the eyes while being colorful and bright. Gradianto ships with the gradients found in nature. There is something for everyone.",
      "repo": "thvardhan/Gradianto",
      "downloads": 1856824,
      "stars": 115,
      "lastUpdated": "2023-10-26T06:12:05Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-batch scripts support",
      "name": "Batch Scripts Support",
      "author": "Unknown Author",
      "description": "Windows Batch Scripts support for IntelliJ IDEA. Supports syntax highlighting, run configurations that can run any command, also empty configurations. Empty run configurations are useful when you want to execute an external tool through a run configuration.",
      "repo": "aefimov/idea-batch",
      "downloads": 1802755,
      "stars": 33,
      "lastUpdated": "2024-06-17T04:52:54Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.demonwav.minecraft-dev",
      "name": "Minecraft Development",
      "author": "minecraft-dev",
      "description": "Provides first-class support for every major Java Minecraft modding or plugin development platform, including: Bukkit Spigot Paper Sponge Forge NeoForge Fabric Architectury Velocity BungeeCord Also includes additional features supporting MCP mappings and Mixins for mod development. This plugin also includes a text-based NBT editor.",
      "repo": "minecraft-dev/MinecraftDev",
      "downloads": 1797513,
      "stars": 1681,
      "lastUpdated": "2025-11-26T22:05:04Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.andrey4623.rainbowcsv",
      "name": "Rainbow CSV",
      "author": "6a6e00fe-865f-4d55-8429-be80d1b3e68f",
      "description": "Plugin for highlighting CSV files in different colors. Features: Supports comma, semicolon, pipe, tab and colon as a delimiter; Supports double quote and backslash as an escape character; Supports custom column colors; Supports a custom comment line prefix. Rainbow CSV settings can be changed in Preferences -&gt; Editor -&gt; General -&gt; Rainbow CSV. Column colors can be changed in Preferences -&gt; Editor -&gt; Color Scheme -&gt; Rainbow CSV.",
      "repo": "andrey4623/intellij-rainbow-csv",
      "downloads": 1761213,
      "stars": 21,
      "lastUpdated": "2023-07-28T13:01:37Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-net.vektah.codeglance",
      "name": "CodeGlance",
      "author": "b10939e8-5c5a-4ccd-88cb-23728cd9c99f",
      "description": "Embeds a code minimap similar to the one found in Sublime into the editor pane. Works with both light and dark themes using your customized colors for syntax highlighting.",
      "repo": "Vektah/CodeGlance",
      "downloads": 1756453,
      "stars": 1061,
      "lastUpdated": "2021-06-15T07:31:43Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.google.idea.bazel.ijwb",
      "name": "Bazel for IntelliJ (legacy)",
      "author": "JetBrains",
      "description": "Bazel project support. As of July 1, 2025, this plugin is maintained by JetBrains. Maintenance is limited to ensuring compatibility with new versions of JetBrains IDEs. No new features or bug fixes will be provided. This plugin is not offered by nor affiliated with Google. The Bazel trademark and logo are the property of Google LLC. Bazel support for IntelliJ IDEA, GoLand and PyCharm is now provided by the new Bazel plugin and is actively developed by JetBrains. Features: Import BUILD files into the IDE. BUILD file custom language support. Support for Bazel run configurations for certain rule classes. Watch this video to familiarize yourself with the plugin's features. Usage instructions here",
      "repo": "bazelbuild/intellij",
      "downloads": 1739691,
      "stars": 804,
      "lastUpdated": "2025-11-26T19:05:07Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-eclipsecodeformatter",
      "name": "Adapter for Eclipse Code Formatter",
      "author": "a23f723e-b2d6-48dc-b7a7-5f898c9b0eb5",
      "description": "Allows using Eclipse's Java code formatter directly from IntelliJ. Solves the problem of maintaining a common code style in team environments where both IDEA and Eclipse are used. Go to https://github.com/krasa/EclipseCodeFormatter#instructions for instructions how to use it. Note: This project utilizes (and in some manners modifies) code licensed under EPL-2.0. For more information see lib/eclipse/README.md. Donations | GitHub | Issues",
      "repo": "krasa/EclipseCodeFormatter",
      "downloads": 1705062,
      "stars": 509,
      "lastUpdated": "2024-09-24T11:51:05Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-org.jetbrains.plugins.terminal",
      "name": "Terminal",
      "author": "JetBrains",
      "description": "The Terminal in JetBrains IDEs (View | Tool Windows | Terminal) is an integrated command-line emulator that allows Developers and DevOps/SRE to run shell commands directly within the IDE interface, minimizing the need to switch between windows. It supports various shell types (e.g., Bash, Zsh, PowerShell) and offers a customizable experience, allowing users to set prompt styles, environment variables, and more. With multiple session support, users can manage tabs, split windows, and use IDE-specific commands, such as executing Git operations that automatically open relevant IDE windows like the Git log. To access the latest features of the terminal and AI capabilities, click \"Enable New Terminal\" in the terminal tab’s context menu (experimental). For more details, refer to the documentation.",
      "repo": "JetBrains/intellij-community",
      "downloads": 1673647,
      "stars": 19193,
      "lastUpdated": "2025-11-26T22:33:42Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-org.jetbrains.plugins.rest",
      "name": "ReStructuredText",
      "author": "JetBrains",
      "description": "This plugin enables support for reStructuredText files (*.rst)",
      "repo": "JetBrains/intellij-community",
      "downloads": 1666037,
      "stars": 19193,
      "lastUpdated": "2025-11-26T22:33:42Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.poratu.idea.plugins.tomcat",
      "name": "Smart Tomcat",
      "author": "3b15b67e-9812-4e8c-9f02-a82c9b035cea",
      "description": "The Tomcat plugin for Intellij IDEA The SmartTomcat will auto load the Webapp classes and libs from project and module, You needn't copy the classes and libs to the WEB-INF/classes and WEB-INF/lib. The Smart Tomcat plugin will auto config the classpath for tomcat server. The Smart Tomcat support Tomcat 6+",
      "repo": "zengkid/SmartTomcat",
      "downloads": 1582922,
      "stars": 134,
      "lastUpdated": "2025-05-05T09:44:26Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.jetbrains.darkpurpletheme",
      "name": "Dark Purple Theme",
      "author": "JetBrains",
      "description": "A dark theme in purple tones. For version 2019.1 and above. To install: Go to Settings (Preferences) | Plugins, find the theme plugin and install it Restart IDE Go to Settings (Preferences) | Appearance &amp; Behavior | Appearance and see the Theme dropdown Report an issue | On GitHub | How to make a theme",
      "repo": "OlyaB/DarkPurpleTheme",
      "downloads": 1580879,
      "stars": 170,
      "lastUpdated": "2025-10-15T13:49:06Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.github.catppuccin.jetbrains",
      "name": "Catppuccin Theme",
      "author": "Catppuccin",
      "description": "Soothing pastel theme for JetBrains IDEs Catppuccin is a community-driven pastel theme that aims to be the middle ground between low and high contrast themes. It consists of 4 soothing warm palettes with 26 eye-candy colors each, perfect for coding, designing, and much more! Design Philosophy Colorful is better than colorless: the colorfulness of something contributes to the distinction amongst the parts of that something, making it marginally easier to understand how things are structured. There should be balance: not too dull, not too bright. Suitability under various light conditions is a must. Harmony is superior to dissonance: vivacious colors must complement each other. Usage There are 4 lovely flavours for you to choose from: Latte, Frappé, Macchiato and Mocha. User Interface Head to Settings → Appearance &amp; Behaviour → Appearance Pick your favourite flavour (Optional) Restart your IDE Code Editor Head to Settings → Editor → Color Scheme Pick your favourite flavour (Optional) Restart your IDE Icon Pack We have created an icon pack to compliment this theme! Search the marketplace for \"**Catppuccin Icons**\" to install it. Help For further help, see also: GitHub Repository Issue Tracker Copyright © 2021-present Catppuccin Org LICENSE: MIT",
      "repo": "catppuccin/jetbrains",
      "downloads": 1557747,
      "stars": 522,
      "lastUpdated": "2025-11-25T21:47:08Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.intellij.tasks",
      "name": "Task Management",
      "author": "JetBrains",
      "description": "Provides task management features for the IDE. Manage and track your work with tasks, including how much time you spend on each one Integrate with issue trackers, such as YouTrack, Jira, and GitHub Save and switch the context for every task: bookmarks, breakpoints, and editor tabs",
      "repo": "JetBrains/intellij-community",
      "downloads": 1532701,
      "stars": 19193,
      "lastUpdated": "2025-11-26T22:33:42Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-de.espend.idea.laravel",
      "name": "Laravel",
      "author": "53c4e65b-321e-41b3-ac95-e8d705c172eb",
      "description": "Laravel Plugin Issues | Donate Install Install plugin and active it per Project under \"Settings &gt; Languages &amp; Frameworks &gt; PHP &gt; Laravel\" Use \"Laravel IDE Helper Generator\" to generate ide classes Configure root Views directory, if not using default file structure (Enable autopopup for completion in plugin setting) Features PHP/Route: Controller completion and goto PHP/Route: Router::resource references PHP/Route: detect route names on \"as\" key PHP/View: completion and goto for view templates PHP/Config: \"providers\" class array completion PHP/Config: Config key indexer, completion and goto PHP/Translation: Translation key indexer, completion and goto PHP: Service dic Blade: extends, include and Php usage linemarker Blade: section, yield, stack overwrite and implements linemarker Blade: Improvements in Blade template name completion and navigation Blade: trans directive Template: Index for Php usage Todo Try to remove \"IDE Helper Generator\" deps; mostly done :) Require Symfony2 Plugin, to reduce duplicate code Support trans/transChoice translation syntax",
      "repo": "Haehnchen/idea-php-laravel-plugin",
      "downloads": 1519725,
      "stars": 572,
      "lastUpdated": "2021-12-13T17:32:53Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.kalessil.phpstorm.phpinspectionsea",
      "name": "Php Inspections (EA Extended)",
      "author": "ea-inspections-team",
      "description": "For support and donations please visit GitHub | Php Inspections (EA Ultimate) | Twitter. This plugin is an open-source Code Review and Static Code Analysis tool for PHP (aka inspections in JetBrains IDEs). It covers: - architecture related issues - weak types control and possible code construct simplifications - performance issues - non-optimal, duplicate and suspicious \"if\" conditions - validation of magic methods usage - regular expressions - compatibility issues - variety of time-consuming bugs - PHPUnit API usage - security issues Some inspections are expecting conditional statements (e.g. \"if\") to use group statement for wrapping body expressions. If this requirement is met then additional inspections are applied to the source code. For Mac shortcuts, see this reference card. Windows/Linux ones are: Alt + Shift + I to inspect current file with current profile Ctrl + Alt + Shift + I to run inspection by name Ctrl + Shift + F4 to close results of inspection. On some projects CPU and therefore battery usage could be intensive, so it should be taken into account when traveling with a laptop. Note: we are sending anonymous crash-reports to Google Analytics. You are welcome to review the implementation or disable the reporting in IDE settings. A big thank you to our supporters: Pixel &amp; Tonic (Bend, USA).",
      "repo": "kalessil/phpinspectionsea",
      "downloads": 1500084,
      "stars": 1473,
      "lastUpdated": "2025-10-08T17:30:07Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-some.awesome",
      "name": "Nyan Progress Bar",
      "author": "1229725d-5e62-4e3c-9c0d-9518661d844c",
      "description": "Pretty progress bars with Nyan Cat for IJ-based IDEs.",
      "repo": "batya239/NyanProgressBar",
      "downloads": 1478822,
      "stars": 294,
      "lastUpdated": "2024-04-28T21:04:03Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-google-java-format",
      "name": "google-java-format",
      "author": "Google",
      "description": "Formats source code using the google-java-format tool. This plugin requires additional IDE configuration. For more information, read the documentation.",
      "repo": "google/google-java-format",
      "downloads": 1463953,
      "stars": 5982,
      "lastUpdated": "2025-10-28T19:28:37Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.samdark.intellij-visual-studio-code-dark-plus",
      "name": "Visual Studio Code Dark Plus Theme",
      "author": "d752e626-7729-4a44-92ca-7074534fe20a",
      "description": "A dark theme for JetBrains IDEs inspired by default Visual Studio Code \"Dark Plus\" theme.",
      "repo": "samdark/intellij-visual-studio-code-dark-plus",
      "downloads": 1436097,
      "stars": 143,
      "lastUpdated": "2025-01-28T00:54:48Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.intellij.resharper.structuredlogging",
      "name": "rider-structured-logging",
      "author": "77ebb2fb-167d-4f1b-99da-9c78b8cd4e18",
      "description": "Contains some useful analyzers for structured logging. Supports Serilog, NLog, and Microsoft.Extensions.Logging. For more information visit the project repository. Release notes",
      "repo": "olsh/resharper-structured-logging",
      "downloads": 1435276,
      "stars": 157,
      "lastUpdated": "2025-11-01T10:15:45Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-sequencediagram",
      "name": "SequenceDiagram Core",
      "author": "VanStudio",
      "description": "SequenceDiagram is tool to generate simple sequence diagram(UML) from source code. Note : Starting from version 4.x, SequenceDiagram has been upgraded to modular structure, which consists of a core module and multiple language extension modules. The Core module remains Freemium. Language modules may be either free or paid. SequenceDiagram Core does not have a built-in language module and must have at least one language extension installed in order to work. The language module plugin are available in the Marketplace: SequenceDiagram JavaSequenceDiagram JSSequenceDiagram RustSequenceDiagram GoSequenceDiagram PythonSequenceDiagram C/C++ Upgrade Guide: SequenceDiagram 3.x = SequenceDiagram Core 4.x + SequenceDiagram Java 4.x. free Generate simple sequence diagram.Navigate the code by click the diagram shape.Save diagram(.sdt)Open diagram file(.sdt)Limited to 5 call deep. freemium Export the diagram as image. (Paid)Export the diagram to PlantUML, Mermaid file format. (Paid)Unlock generator limits. (Paid)Filter Manager. (Paid)",
      "repo": "Vanco/SequencePlugin",
      "downloads": 1433307,
      "stars": 705,
      "lastUpdated": "2025-06-07T05:48:52Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.intellij.resharper.azure",
      "name": "Azure Toolkit for Rider",
      "author": "JetBrains",
      "description": "This is the JetBrains Rider Plugin for Azure Cloud Services Integration. The plugin streamlines the development, deployment, and management of .NET applications on Azure, directly from Rider and across all supported platforms. Key features: Azure App Services: Easily create, deploy, and manage .NET Web Apps on any platform. Azure Functions: Manage your Function Apps and deployment slots. Run and debug them locally. Databases: Create and manage SQL Server, PostgreSQL, and MySQL databases with ease. Azure Explorer: Visualize and manage your Azure resources, including Web and Function Apps, databases, Redis caches, virtual machines, storage accounts, and more. Azure Cloud Shell: Use a built-in Cloud Shell terminal to run commands in your Azure subscription, upload files, intercept downloads, and open a browser to retrieve files from the Cloud Shell. Core tools: Utilize Azure Functions Core Tools in project and item templates and use the corresponding configuration to run/debug .NET Function Apps. Azurite Emulator: Start, stop, and manage a local instance of Azurite.",
      "repo": "JetBrains/azure-tools-for-intellij",
      "downloads": 1392827,
      "stars": 51,
      "lastUpdated": "2025-11-24T22:29:43Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.github.dinbtechit.vscodetheme",
      "name": "VSCode Theme",
      "author": "1f63ae1e-5f13-4e8b-928d-88d561a09286",
      "description": "Provides Visual Studio Code / VSCode Editor Color Scheme for Jetbrains IDEs (webstorm, Intellij, Rider &amp; many more); This plugin aims to closely emulate the VSCode theme within the IDE, simplifying the process of switching between different development environments. Note - Some text colors might not be accurate due to either JetBrains does not allow us to override those colors or the default colors being more intuitive. Themes: Dark: VSCode Dark+VSCode Dark Modern Light: VSCode Light Modern (Experimental - Feel free to report bugs at https://github.com/dinbtechit/vscode-theme/issues) For Best Viewing Experience: Plugins: VSCode Theme + Rainbow Brackets Supported Languages Advance Syntax highlighting Support: JavaScript, TypeScript, Java, Dart/Flutter, Rust, Python, Kotlin, C#/F#, Php, GoC, C++ and Objective-CBasic Syntax highlighting:Ruby and many more. Supported Platforms Intellij, Webstorm, Android Studio, CLion, PhpStorm, Rider, GoLang and many more.",
      "repo": "dinbtechit/vscode-theme",
      "downloads": 1353682,
      "stars": 1084,
      "lastUpdated": "2025-09-23T12:16:09Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-rider ui theme pack",
      "name": "Rider UI Theme Pack",
      "author": "JetBrains",
      "description": "Set of UI themes for Rider IDE: - Rider, Day and Night (for the New UI) - Rider, Light and Dark - Rider Melon, Light and Dark - Visual Studio, Light and Dark - Visual Studio with ReSharper, Light and Dark - Visual Studio with Visual Assist, Light and Dark",
      "repo": "JetBrains/rider-theme-pack",
      "downloads": 1335004,
      "stars": 29,
      "lastUpdated": "2025-10-09T08:29:05Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-dev.blachut.svelte.lang",
      "name": "Svelte",
      "author": "JetBrains",
      "description": "Support for Svelte in your IDE of choice. Features Syntax highlighting Code formatting Typing assistance Emmet-style abbreviations of Svelte blocks Completions of components, props and some directives Auto import of components Navigation from components to their definition Debugger integration",
      "repo": "tomblachut/svelte-intellij",
      "downloads": 1294127,
      "stars": 508,
      "lastUpdated": "2025-11-20T17:28:32Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-com.intellij.resharper.heapallocationsviewer",
      "name": "Heap Allocations Viewer",
      "author": "787928c4-c85e-43a4-bbc6-d7d1e1c0c0be",
      "description": "Highlights local object allocations, boxing, delegates and closure creations points.",
      "repo": "controlflow/resharper-heapview",
      "downloads": 1291944,
      "stars": 325,
      "lastUpdated": "2025-11-24T16:24:23Z",
      "isTop100": true
    },
    {
      "id": "jetbrains-de.netnexus.camelcaseplugin",
      "name": "CamelCase",
      "author": "netnexus",
      "description": "Switch easily between kebab-case, SNAKE_CASE, PascalCase, camelCase, snake_case or space case. See Edit menu or use ⇧ + ⌥ + U / Shift + Alt + U. Please have a look at the preferences of this plugin: You can disable some conversions or change their order. If you find something is not working or missing, feel free to submit a PR on our GitHub repo.",
      "repo": "netnexus/camelcaseplugin",
      "downloads": 1240015,
      "stars": 69,
      "lastUpdated": "2022-01-14T17:36:25Z",
      "isTop100": true
    }
  ]
}